vageeshgaonkar1-git/Vehicle_Emission_Monitor_Embedded/stm32/main.c
/**
 * STM32 Vehicle Emissions Monitor Firmware
 * Target: STM32F411CEU6 (Black Pill)
 *
 * Peripheral map:
 *   I2C1      PB6 (SCL) / PB7 (SDA)  — MPU6050 (vibration) + DS3231 (RTC)
 *   ADC1      PA0 (MQ-7 CO)           — 12-bit, single-conversion
 *             PA1 (MQ-135 NOx/smoke)
 *   GPIO      PA5 output              — N-channel MOSFET → 12 V blower fan
 *             PA4 input               — DHT22 data line (4.7 kΩ pull-up on board)
 *   UART2     PA2 (TX) / PA3 (RX)     — UART bridge to ESP32 Wi-Fi module
 *
 * Transmit path (ESP32 integrated):
 *   UART_Frames are sent over UART2 (PA2 TX → ESP32 GPIO16 RX) at 115200 baud.
 *   The ESP32 receives each newline-terminated JSON frame, validates it, and
 *   publishes it to the MQTT broker over Wi-Fi.
 *
 * Wiring:
 *   STM32 PA2 (TX)  → ESP32 GPIO16 (RX2)
 *   STM32 PA3 (RX)  → ESP32 GPIO17 (TX2)   [optional, for future commands]
 *   STM32 GND       → ESP32 GND             [shared ground — required]
 *   IMPORTANT: STM32 is 3.3 V; ESP32 GPIO is also 3.3 V — direct connection is safe.
 *
 * State machine:
 *   Purge  → PA5 HIGH for PURGE_MS  (default 3 000 ms)
 *   Settle → PA5 LOW  for SETTLE_MS (default 2 000 ms)
 *   Sample → read all sensors, build UART_Frame, transmit over UART2
 */

#include "stm32f4xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <stdint.h>

/* ── Configurable timing (ms) ─────────────────────────────────────────────── */
#ifndef PURGE_MS
#define PURGE_MS   15000U   /* fan ON for 15 seconds (purge) */
#endif
#ifndef SETTLE_MS
#define SETTLE_MS  10000U   /* fan OFF for 10 seconds (settle) — 25s total cycle */
#endif

/* ── I2C device addresses (7-bit, shifted left 1 for HAL) ─────────────────── */
/*
 * MPU6050: fixed I2C address 0x68 (AD0 pin LOW, which is the default).
 */
#define MPU6050_ADDR  (0x68 << 1)

/*
 * DS3231: default address is also 0x68, which collides with MPU6050.
 * HARDWARE FIX REQUIRED: pull the DS3231 A0 pin HIGH (connect A0 to VCC
 * through a 10 kΩ resistor) to move it to address 0x69.
 * This address reflects that hardware change.
 */
#define DS3231_ADDR   (0x69 << 1)

/* MPU6050 registers */
#define MPU6050_REG_PWR_MGMT_1  0x6B
#define MPU6050_REG_ACCEL_XOUT  0x3B

/* DS3231 registers */
#define DS3231_REG_SECONDS  0x00

/*
 * VIBRATION_THRESHOLD — maximum allowable deviation from the gravity baseline
 * before the engine is declared "running".
 *
 * At rest, gravity produces ~16384 LSB on one accelerometer axis (±2 g range).
 * Comparing raw magnitude against a fixed value always fires because gravity
 * alone exceeds any reasonable threshold.  Instead, we capture a still-state
 * baseline at startup and compare the current reading's Euclidean distance
 * from that baseline.  A delta > VIBRATION_THRESHOLD means the board is
 * experiencing acceleration beyond gravity → engine vibration detected.
 *
 * Default 800 LSB ≈ 0.05 g — sensitive enough for idling engines, high
 * enough to ignore cable sway.  Override with -DVIBRATION_THRESHOLD=N.
 */
#ifndef VIBRATION_THRESHOLD
#define VIBRATION_THRESHOLD  250   /* 250 LSB — reliable for hand-tap */
#endif

/*
 * Number of accelerometer samples averaged to build the still baseline.
 * Taken once during the 2-second USB enumeration delay at startup.
 */
#define BASELINE_SAMPLES  20

/* ── HAL peripheral handles ───────────────────────────────────────────────── */
I2C_HandleTypeDef  hi2c1;
ADC_HandleTypeDef  hadc1;
UART_HandleTypeDef huart2;   /* UART2: PA2 TX → ESP32 GPIO16 RX */
TIM_HandleTypeDef  htim2;    /* 1 µs tick for DHT22 bit-bang */

/*
 * MPU6050 still-state baseline (set once at startup by mpu6050_calibrate).
 * mpu6050_is_running() measures the Euclidean distance of the current reading
 * from this baseline — avoiding false positives caused by gravity.
 */
static int16_t mpu_baseline_ax = 0;
static int16_t mpu_baseline_ay = 0;
static int16_t mpu_baseline_az = 0;

/* ── MQ-7 dynamic baseline calibration ───────────────────────────────────────
 * MQ7_R0 is measured at startup in clean air by calibrate_mq7_baseline().
 * A hard-coded fallback of 10.0 kΩ is used if calibration is skipped.
 * RL and V_SUPPLY must match the physical circuit.
 */
static float MQ7_R0    = 10.0f;  /* sensor resistance in clean air (kΩ) — set by calibration */
static const float MQ7_RL       = 10.0f;  /* load resistor (kΩ) */
static const float MQ7_V_SUPPLY = 3.3f;   /* ADC reference / sensor Vcc (V) */

/* ═══════════════════════════════════════════════════════════════════════════
 *  Forward declarations
 * ═══════════════════════════════════════════════════════════════════════════ */
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_ADC1_Init(void);
static void MX_UART2_Init(void);
static void MX_TIM2_Init(void);

static void     dht22_set_output(void);
static void     dht22_set_input(void);
static void     dht22_write(GPIO_PinState state);
static uint8_t  dht22_read_bit(void);
static HAL_StatusTypeDef dht22_read(float *temperature, float *humidity);

static uint16_t adc_read_channel(uint32_t channel);
static void     mpu6050_calibrate(void);
static int      mpu6050_is_running(void);
static void     calibrate_mq7_baseline(void);
static HAL_StatusTypeDef ds3231_get_timestamp(char *buf, size_t len);

float dht22_correct_gas(uint16_t raw_adc, float temperature, float humidity);
static float mq7_read_ppm(uint16_t raw_adc, float temperature, float humidity);
static float mq135_read_ppm(uint16_t raw_adc, float temperature, float humidity);

static void run_state_machine(void);
static void transmit_frame(float co, float nox, float temp, float hum,
                            int is_running, const char *timestamp);
static void delay_us(uint32_t us);

/* ═══════════════════════════════════════════════════════════════════════════
 *  main
 * ═══════════════════════════════════════════════════════════════════════════ */
int main(void)
{
    HAL_Init();
    SystemClock_Config();

