vageeshgaonkar1-git/Vehicle_Emission_Monitor_Embedded/stm32/main.c
    *ax = (int16_t)((buf[0] << 8) | buf[1]);
    *ay = (int16_t)((buf[2] << 8) | buf[3]);
    *az = (int16_t)((buf[4] << 8) | buf[5]);
    return HAL_OK;
}

/**
 * Capture the still-state baseline.
 * Call once at startup with the engine off and the board stationary.
 * Averages BASELINE_SAMPLES readings to reduce noise.
 */
static void mpu6050_calibrate(void)
{
    int32_t sum_ax = 0, sum_ay = 0, sum_az = 0;
    int     valid  = 0;

    for (int i = 0; i < BASELINE_SAMPLES; i++) {
        int16_t ax, ay, az;
        if (mpu6050_read_accel(&ax, &ay, &az) == HAL_OK) {
            sum_ax += ax;
            sum_ay += ay;
            sum_az += az;
            valid++;
        }
        HAL_Delay(10);   /* 10 ms between samples → 200 ms total calibration window */
    }

    if (valid > 0) {
        mpu_baseline_ax = (int16_t)(sum_ax / valid);
        mpu_baseline_ay = (int16_t)(sum_ay / valid);
        mpu_baseline_az = (int16_t)(sum_az / valid);
    }
    /* If no valid samples, baseline stays at zero — worst case is a false
     * positive on the first few cycles, which is acceptable. */
}

/**
 * Returns 1 if engine vibration is detected, 0 otherwise.
 * Uses Euclidean distance from the calibrated still-state baseline.
 */
static int mpu6050_is_running(void)
{
    int16_t ax, ay, az;
    if (mpu6050_read_accel(&ax, &ay, &az) != HAL_OK) return 0;

    int32_t dx = (int32_t)ax - mpu_baseline_ax;
    int32_t dy = (int32_t)ay - mpu_baseline_ay;
    int32_t dz = (int32_t)az - mpu_baseline_az;

    /* Integer square root is not available in all C89 runtimes on Cortex-M.
     * Compare squared distance to avoid sqrt — safe because both sides are
     * non-negative and the threshold fits well within int32_t range. */
    int32_t dist_sq      = dx * dx + dy * dy + dz * dz;
    int32_t threshold_sq = (int32_t)VIBRATION_THRESHOLD * VIBRATION_THRESHOLD;

    return (dist_sq > threshold_sq) ? 1 : 0;
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  DS3231 — hardware RTC timestamp
 * ═══════════════════════════════════════════════════════════════════════════ */
static uint8_t bcd2dec(uint8_t bcd) { return (bcd >> 4) * 10 + (bcd & 0x0F); }

static HAL_StatusTypeDef ds3231_get_timestamp(char *buf, size_t len)
{
    uint8_t regs[7];
    /* Use a short timeout (50ms) so a missing/broken DS3231 doesn't
     * block the entire state machine indefinitely. */
    HAL_StatusTypeDef status = HAL_I2C_Mem_Read(
        &hi2c1, DS3231_ADDR, DS3231_REG_SECONDS,
        I2C_MEMADD_SIZE_8BIT, regs, 7, 50);

    if (status != HAL_OK) return HAL_ERROR;

    uint8_t  sec  = bcd2dec(regs[0] & 0x7F);
    uint8_t  min  = bcd2dec(regs[1] & 0x7F);
    uint8_t  hour = bcd2dec(regs[2] & 0x3F);
    uint8_t  date = bcd2dec(regs[4] & 0x3F);
    uint8_t  mon  = bcd2dec(regs[5] & 0x1F);
    uint16_t yr   = 2000U + bcd2dec(regs[6]);

    snprintf(buf, len, "%04u-%02u-%02uT%02u:%02u:%02u.000Z",
             yr, mon, date, hour, min, sec);
    return HAL_OK;
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  UART_Frame transmit over UART2 to ESP32
 *
 *  Each frame is a minified JSON string terminated by '\n'.
 *  The ESP32 reads until '\n' to detect a complete frame, then publishes
 *  it to the MQTT broker over Wi-Fi.
 *
 *  HAL_UART_Transmit() is blocking with a 100 ms timeout — sufficient for
 *  a ~200-byte frame at 115200 baud (~17 ms theoretical).
 * ═══════════════════════════════════════════════════════════════════════════ */
static void transmit_frame(float co, float nox, float temp, float hum,
                            int is_running, const char *timestamp)
{
    char frame[256];
    int len = snprintf(frame, sizeof(frame),
        "{\"co\":%.2f,\"nox\":%.2f,\"temp\":%.2f,\"hum\":%.2f,"
        "\"is_running\":%d,\"timestamp\":\"%s\"}\n",
        co, nox, temp, hum, is_running, timestamp);

    if (len <= 0 || len >= (int)sizeof(frame)) return;

    /* Transmit over UART2 → ESP32 GPIO16 (RX2) */
    HAL_UART_Transmit(&huart2, (uint8_t *)frame, (uint16_t)len, 100);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  Purge → Settle → Sample state machine
 *  Cycle: 15s fan ON (purge) + 10s fan OFF (settle) + sample = 25s total
 *  Vibration is polled every 1s during settle so engine-on events are not
 *  missed during the blocking delay windows.
 * ═══════════════════════════════════════════════════════════════════════════ */
/* Temporary Calibration Loop */
static void run_state_machine(void)
{
    /* ── PURGE: fan ON for PURGE_MS ── */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
    HAL_Delay(PURGE_MS);

    /* ── SETTLE: fan OFF, poll vibration every 1 s ── */
    /* ── SETTLE: fan OFF, poll vibration continuously at 100 Hz ── */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);

  int is_running = 0;
  int vib_count  = 0;
  uint32_t settle_start = HAL_GetTick();

  /* Loop rapidly for exactly SETTLE_MS (10 seconds) */
  while ((HAL_GetTick() - settle_start) < SETTLE_MS) {
    if (mpu6050_is_running()) {
      vib_count++;
    }
    HAL_Delay(10); /* Check every 10ms, not every 1000ms */
  }

  /* Require a few consecutive vibration hits to filter out single-tap noise */
  if (vib_count >= 3) is_running = 1;

    /* ── SAMPLE: read all sensors at end of settle phase ── */
    float temperature = 25.0f;
    float humidity    = 50.0f;
    dht22_read(&temperature, &humidity);

    uint16_t raw_co  = adc_read_channel(ADC_CHANNEL_0);
    uint16_t raw_nox = adc_read_channel(ADC_CHANNEL_1);

    /* MQ-7 on PA0 → CO in ppm, MQ-135 on PA1 → NOx/air quality in ppm */
    float co  = mq7_read_ppm(raw_co,   temperature, humidity);
    float nox = mq135_read_ppm(raw_nox, temperature, humidity);

    char timestamp[32];
    if (ds3231_get_timestamp(timestamp, sizeof(timestamp)) != HAL_OK) {
        timestamp[0] = '\0';
    }

    transmit_frame(co, nox, temperature, humidity, is_running, timestamp);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  System clock — STM32F411CEU6 at 96 MHz
 *  HSE 25 MHz (Black Pill crystal) → PLL → 96 MHz SYSCLK
 *  USB requires a 48 MHz clock: PLLQ = 4 → 96/4 = 48 MHz ✓
 * ═══════════════════════════════════════════════════════════════════════════ */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc = {0};
    osc.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    osc.HSEState       = RCC_HSE_ON;
    osc.PLL.PLLState   = RCC_PLL_ON;
    osc.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    osc.PLL.PLLM       = 25;   /* 25 MHz HSE / 25 = 1 MHz VCO input  */
    osc.PLL.PLLN       = 192;  /* × 192 = 192 MHz VCO                */
    osc.PLL.PLLP       = RCC_PLLP_DIV2;  /* 192 / 2 = 96 MHz SYSCLK */
    osc.PLL.PLLQ       = 4;    /* 192 / 4 = 48 MHz USB clock ✓       */
    HAL_RCC_OscConfig(&osc);

    RCC_ClkInitTypeDef clk = {0};
    clk.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                       | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    clk.AHBCLKDivider  = RCC_SYSCLK_DIV1;   /* HCLK  = 96 MHz */
    clk.APB1CLKDivider = RCC_HCLK_DIV2;     /* PCLK1 = 48 MHz (max for F411) */
    clk.APB2CLKDivider = RCC_HCLK_DIV1;     /* PCLK2 = 96 MHz */
    HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_3);
}
